---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions.#ctor
source: html/7d52fd51-0a7d-3ead-2c2d-ea9631dc2380.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions.#ctor Method

Create an object with default values.

## Syntax (C#)
```csharp
public AlignmentStationLabelSetOptions()
```